{
  "family": "iso20000",
  "version": "2018",
  "name": "ISO/IEC 20000-1:2018",
  "description": "Information technology - Service management - Part 1: Service management system requirements",
  "requirements": [
    {
      "code": "4.1",
      "title": "Understanding the organization and its context",
      "description": "The organization shall determine external and internal issues that are relevant to its purpose and that affect its ability to achieve the intended outcome(s) of its SMS.",
      "description_long": "The organization shall determine external and internal issues that are relevant to its purpose and that affect its ability to achieve the intended outcome(s) of its service management system. These issues can include positive and negative factors or conditions for consideration.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Context of the organization",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "4.2",
      "title": "Understanding the needs and expectations of interested parties",
      "description": "The organization shall determine the interested parties that are relevant to the SMS and the requirements of these interested parties relevant to service management.",
      "description_long": "The organization shall determine the interested parties that are relevant to the service management system, the requirements of these interested parties relevant to service management, and which of these requirements will be addressed through the service management system.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Context of the organization",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "4.3",
      "title": "Determining the scope of the service management system",
      "description": "The organization shall determine the boundaries and applicability of the SMS to establish its scope.",
      "description_long": "When determining this scope, the organization shall consider the external and internal issues, the requirements of interested parties, and the services delivered by the organization or other parties.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Context of the organization",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "4.4",
      "title": "Service management system",
      "description": "The organization shall establish, implement, maintain and continually improve an SMS, including the processes needed and their interactions.",
      "description_long": "The organization shall establish, implement, maintain and continually improve a service management system, including the processes needed and their interactions, in accordance with the requirements of this document.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Context of the organization",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "5.1",
      "title": "Leadership and commitment",
      "description": "Top management shall demonstrate leadership and commitment with respect to the SMS.",
      "description_long": "Top management shall demonstrate leadership and commitment by ensuring that the service management policy and service management objectives are established and are compatible with the strategic direction of the organization, ensuring the integration of the SMS requirements into the organization's business processes, ensuring that the resources needed for the SMS are available, and communicating the importance of effective service management.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Leadership",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "5.2",
      "title": "Policy",
      "description": "Top management shall establish a service management policy that is appropriate to the purpose of the organization.",
      "description_long": "The service management policy shall be appropriate to the purpose of the organization, provide a framework for setting service management objectives, include a commitment to satisfy applicable requirements, and include a commitment to continual improvement of the SMS.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Leadership",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "5.3",
      "title": "Organizational roles, responsibilities and authorities",
      "description": "Top management shall ensure that the responsibilities and authorities for roles relevant to the SMS are assigned and communicated within the organization.",
      "description_long": "Top management shall assign the responsibility and authority for ensuring that the SMS conforms to the requirements of this document, and reporting on the performance of the SMS to top management.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Leadership",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "6.1",
      "title": "Actions to address risks and opportunities",
      "description": "When planning for the SMS, the organization shall consider the issues and requirements and determine the risks and opportunities that need to be addressed.",
      "description_long": "The organization shall plan actions to address these risks and opportunities, how to integrate and implement the actions into its SMS processes, and how to evaluate the effectiveness of these actions.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Planning",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "risk-management"]
    },
    {
      "code": "6.2",
      "title": "Service management objectives and planning to achieve them",
      "description": "The organization shall establish service management objectives at relevant functions, levels and processes needed for the SMS.",
      "description_long": "The service management objectives shall be consistent with the service management policy, be measurable, take into account applicable requirements, be monitored, be communicated, and be updated as appropriate.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Planning",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "6.3",
      "title": "Plan the service management system",
      "description": "The organization shall create, implement and maintain a plan for service management.",
      "description_long": "The plan shall include or contain a reference to the service management policy, service management objectives, information about how the SMS processes will be integrated, information about how the SMS processes will be documented, and the resources needed for the SMS.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Planning",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "7.1",
      "title": "Resources",
      "description": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the SMS.",
      "description_long": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the service management system, including human resources, technical resources, information resources, and financial resources.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Support",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "7.2",
      "title": "Competence",
      "description": "The organization shall determine the necessary competence of person(s) doing work under its control that affects the performance and effectiveness of the SMS.",
      "description_long": "The organization shall ensure that these persons are competent on the basis of appropriate education, training, or experience, where applicable take actions to acquire the necessary competence, and retain appropriate documented information as evidence of competence.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Support",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "training"]
    },
    {
      "code": "7.3",
      "title": "Awareness",
      "description": "Persons doing work under the organization's control shall be aware of the service management policy, their contribution to the effectiveness of the SMS, and the implications of not conforming with the SMS requirements.",
      "description_long": "Persons doing work under the organization's control shall be aware of the service management policy, relevant service management objectives, their contribution to the effectiveness of the SMS including the benefits of improved performance, and the implications of not conforming with the SMS requirements.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Support",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "training"]
    },
    {
      "code": "7.4",
      "title": "Communication",
      "description": "The organization shall determine the internal and external communications relevant to the SMS.",
      "description_long": "The organization shall determine the internal and external communications relevant to the SMS including on what it will communicate, when to communicate, with whom to communicate, how to communicate, and who communicates.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Support",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "7.5",
      "title": "Documented information",
      "description": "The organization's SMS shall include documented information required by this document and documented information determined by the organization as being necessary for the effectiveness of the SMS.",
      "description_long": "When creating and updating documented information, the organization shall ensure appropriate identification and description, format and media, and review and approval for suitability and adequacy.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Support",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "7.6",
      "title": "Knowledge",
      "description": "The organization shall determine the knowledge necessary for the operation of the SMS and the delivery and management of services.",
      "description_long": "This knowledge shall be maintained and made available to the extent necessary. When addressing changing needs and trends, the organization shall consider its current knowledge and determine how to acquire or access any necessary additional knowledge.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Support",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.1",
      "title": "Operational planning and control",
      "description": "The organization shall plan, implement and control the processes needed to meet requirements for the delivery and management of services.",
      "description_long": "The organization shall plan, implement and control the processes needed to meet requirements for the delivery and management of services by establishing criteria for the processes, implementing control of the processes in accordance with the criteria, and keeping documented information to the extent necessary to have confidence that the processes have been carried out as planned.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "operations"]
    },
    {
      "code": "8.2",
      "title": "Service portfolio",
      "description": "The organization shall create and maintain a service portfolio.",
      "description_long": "The service portfolio shall include the current services, services being developed or planned, and services that have been removed. The organization shall manage the service portfolio to ensure that the services support the achievement of the agreed outcomes for the organization and its customers.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.2.2",
      "title": "Plan the services",
      "description": "The organization shall plan the services, including creating or changing the service portfolio, policies, plans, and documented information.",
      "description_long": "The organization shall determine the requirements for new services or changes to existing services, plan the resources needed, plan the activities needed to design, build, transition and deliver the services, and plan how to measure and report on the services.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.2.3",
      "title": "Control of parties involved in the service lifecycle",
      "description": "The organization shall determine and manage parties involved in the service lifecycle.",
      "description_long": "The organization shall determine and document the roles and relationships of the organization, customers, users, suppliers and other parties involved in the service lifecycle. The organization shall appoint a relationship manager for each customer.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "vendor-management"]
    },
    {
      "code": "8.2.4",
      "title": "Service catalogue management",
      "description": "The organization shall create and maintain a service catalogue.",
      "description_long": "The service catalogue shall include information about each service, including the name and description of the service, the service category, the service level targets, and the interfaces and dependencies between services.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.2.5",
      "title": "Asset management",
      "description": "The organization shall ensure that assets used to deliver services are managed to meet service requirements and obligations.",
      "description_long": "The organization shall maintain information about assets and configuration items, including the relationships between them. The organization shall control changes to assets and configuration items.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "asset-management"]
    },
    {
      "code": "8.2.6",
      "title": "Configuration management",
      "description": "The organization shall define the types of configuration items and their attributes.",
      "description_long": "The organization shall define the types of configuration items, record configuration items in a configuration management database, control changes to configuration items, and maintain the accuracy of configuration information.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "operations"]
    },
    {
      "code": "8.3",
      "title": "Relationship and agreement",
      "description": "The organization shall manage relationships with customers, suppliers and other parties.",
      "description_long": "The organization shall establish and maintain relationships with customers, suppliers and other parties involved in the service lifecycle. The organization shall establish and maintain agreements with customers and suppliers.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.3.2",
      "title": "Business relationship management",
      "description": "The organization shall identify and document customers, users and other stakeholders of the services.",
      "description_long": "The organization shall appoint a relationship manager for each customer, establish and maintain a communication mechanism with customers, and measure customer satisfaction at planned intervals.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.3.3",
      "title": "Service level management",
      "description": "The organization shall agree service level agreements with customers and service level targets for each service.",
      "description_long": "The organization shall agree service level agreements with customers, monitor and report on service levels, review service level agreements and service level targets at planned intervals, and take action when service level targets are not met.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.3.4",
      "title": "Supplier management",
      "description": "The organization shall manage suppliers to ensure the provision of quality services.",
      "description_long": "The organization shall determine and document the requirements for suppliers, select suppliers based on their ability to meet requirements, establish and maintain contracts with suppliers, monitor and review supplier performance, and manage changes to suppliers and contracts.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "vendor-management"]
    },
    {
      "code": "8.4",
      "title": "Supply and demand",
      "description": "The organization shall manage the supply and demand for services.",
      "description_long": "The organization shall manage the supply and demand for services to ensure that services can be delivered to meet agreed service levels and that resources are used efficiently.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.4.2",
      "title": "Budgeting and accounting for services",
      "description": "The organization shall budget and account for services or groups of services.",
      "description_long": "The organization shall budget and account for services or groups of services, including the costs of assets, shared resources, overhead, externally supplied services, personnel, insurance, and licenses.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.4.3",
      "title": "Demand management",
      "description": "The organization shall manage demand for services.",
      "description_long": "The organization shall determine the current and future demand for services, monitor demand for services, and take action to manage demand to ensure that services can be delivered to meet agreed service levels.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.4.4",
      "title": "Capacity management",
      "description": "The organization shall determine and manage the capacity required to deliver services.",
      "description_long": "The organization shall determine the current and future capacity requirements, monitor capacity, and take action to ensure that sufficient capacity is available to meet agreed service levels.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.5",
      "title": "Service design, build and transition",
      "description": "The organization shall design, build and transition new or changed services.",
      "description_long": "The organization shall plan and manage the design, build and transition of new or changed services to ensure that they meet the requirements of customers and other interested parties.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.5.2",
      "title": "Change management",
      "description": "The organization shall manage all changes to services and service components.",
      "description_long": "The organization shall establish a change management policy, record and classify all change requests, assess the risks and impacts of changes, approve or reject changes, plan and schedule changes, and review and close changes.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "operations"]
    },
    {
      "code": "8.5.3",
      "title": "Service design and transition",
      "description": "The organization shall plan and manage the design and transition of new or changed services.",
      "description_long": "The organization shall plan the design and transition activities, design the service to meet the requirements, build and test the service, transition the service to the live environment, and review the design and transition.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.5.4",
      "title": "Release and deployment management",
      "description": "The organization shall plan and manage the release and deployment of new or changed services.",
      "description_long": "The organization shall establish a release policy, plan releases, build and test releases, deploy releases to the live environment, and review releases.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "operations"]
    },
    {
      "code": "8.6",
      "title": "Resolution and fulfilment",
      "description": "The organization shall resolve incidents and fulfil service requests.",
      "description_long": "The organization shall resolve incidents and fulfil service requests to restore normal service operation as quickly as possible and to minimize the adverse impact on business operations.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "incident-management"]
    },
    {
      "code": "8.6.2",
      "title": "Incident management",
      "description": "The organization shall manage all incidents throughout their lifecycle.",
      "description_long": "The organization shall record and classify all incidents, prioritize incidents based on their impact and urgency, escalate incidents as appropriate, resolve incidents, and close incidents.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "incident-management"]
    },
    {
      "code": "8.6.3",
      "title": "Service request management",
      "description": "The organization shall manage all service requests throughout their lifecycle.",
      "description_long": "The organization shall record and classify all service requests, prioritize service requests, fulfil service requests, and close service requests.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.6.4",
      "title": "Problem management",
      "description": "The organization shall manage all problems throughout their lifecycle.",
      "description_long": "The organization shall identify and record problems, analyze problems to determine root causes, identify workarounds and permanent solutions, implement solutions, and close problems.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "incident-management"]
    },
    {
      "code": "8.7",
      "title": "Service assurance",
      "description": "The organization shall assure services to meet agreed requirements.",
      "description_long": "The organization shall assure services to meet agreed requirements through service availability management, service continuity management, and information security management.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.7.2",
      "title": "Service availability management",
      "description": "The organization shall manage the availability of services to meet agreed service levels.",
      "description_long": "The organization shall determine availability requirements, monitor and report on availability, analyze availability data, and take action to improve availability.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "8.7.3",
      "title": "Service continuity management",
      "description": "The organization shall manage service continuity to meet agreed requirements.",
      "description_long": "The organization shall determine service continuity requirements, create and maintain service continuity plans, test service continuity plans, and review and update service continuity plans.",
      "hierarchy_level": "subcontrol",
      "domain": "itservice",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "business-continuity"]
    },
    {
      "code": "8.7.4",
      "title": "Information security management",
      "description": "The organization shall manage information security to meet agreed requirements.",
      "description_long": "The organization shall determine information security requirements, implement information security controls, monitor and review information security, and manage information security incidents.",
      "hierarchy_level": "subcontrol",
      "domain": "security",
      "category": "Operation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["security", "itservice"]
    },
    {
      "code": "9.1",
      "title": "Monitoring, measurement, analysis and evaluation",
      "description": "The organization shall determine what needs to be monitored and measured, the methods for monitoring, measurement, analysis and evaluation.",
      "description_long": "The organization shall determine what needs to be monitored and measured, the methods for monitoring, measurement, analysis and evaluation, when the monitoring and measuring shall be performed, when the results from monitoring and measurement shall be analyzed and evaluated, and retain appropriate documented information as evidence of the results.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Performance evaluation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "9.2",
      "title": "Internal audit",
      "description": "The organization shall conduct internal audits at planned intervals to provide information on whether the SMS conforms to the organization's own requirements and the requirements of this document.",
      "description_long": "The organization shall plan, establish, implement and maintain an audit program including the frequency, methods, responsibilities, planning requirements and reporting. The organization shall define the audit criteria and scope for each audit.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Performance evaluation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "audit"]
    },
    {
      "code": "9.3",
      "title": "Management review",
      "description": "Top management shall review the organization's SMS at planned intervals to ensure its continuing suitability, adequacy and effectiveness.",
      "description_long": "The management review shall include consideration of the status of actions from previous management reviews, changes in external and internal issues, information on the performance of the SMS, opportunities for continual improvement, and the results of risk assessment and the status of the risk treatment plan.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Performance evaluation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice", "governance"]
    },
    {
      "code": "9.4",
      "title": "Service reporting",
      "description": "The organization shall produce service reports to support effective decision making and communication.",
      "description_long": "The organization shall determine the requirements for service reports, produce service reports at planned intervals, and review service reports to identify opportunities for improvement.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Performance evaluation",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "10.1",
      "title": "Nonconformity and corrective action",
      "description": "When a nonconformity occurs, the organization shall react to the nonconformity, evaluate the need for action to eliminate the causes, implement any action needed, and review the effectiveness of any corrective action taken.",
      "description_long": "The organization shall react to the nonconformity and take action to control and correct it and deal with the consequences. The organization shall evaluate the need for action to eliminate the causes of the nonconformity, implement any action needed, review the effectiveness of any corrective action taken, and make changes to the SMS if necessary.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Improvement",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    },
    {
      "code": "10.2",
      "title": "Continual improvement",
      "description": "The organization shall continually improve the suitability, adequacy and effectiveness of the SMS and the services.",
      "description_long": "The organization shall determine and select opportunities for improvement and implement any necessary actions to meet customer requirements and enhance customer satisfaction. This shall include improving the SMS, improving services, and improving the SMS processes.",
      "hierarchy_level": "clause",
      "domain": "itservice",
      "category": "Improvement",
      "regulation": "ISO 20000-1:2018",
      "metadata_tags": ["itservice"]
    }
  ]
}
