{
  "family": "iso9001",
  "version": "2015",
  "name": "ISO 9001:2015",
  "description": "Quality management systems - Requirements",
  "requirements": [
    {
      "code": "4.1",
      "title": "Understanding the organization and its context",
      "description": "The organization shall determine external and internal issues that are relevant to its purpose and its strategic direction and that affect its ability to achieve the intended result(s) of its quality management system.",
      "description_long": "The organization shall monitor and review information about these external and internal issues. External issues can include legal, technological, competitive, market, cultural, social and economic environments. Internal issues can include values, culture, knowledge and performance of the organization.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Context of the organization",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "4.2",
      "title": "Understanding the needs and expectations of interested parties",
      "description": "The organization shall determine the interested parties that are relevant to the quality management system and the requirements of these interested parties that are relevant to the quality management system.",
      "description_long": "The organization shall monitor and review information about these interested parties and their relevant requirements. Interested parties can include customers, owners, people in the organization, providers, bankers, regulators, unions, partners, or society.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Context of the organization",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "4.3",
      "title": "Determining the scope of the quality management system",
      "description": "The organization shall determine the boundaries and applicability of the quality management system to establish its scope.",
      "description_long": "When determining this scope, the organization shall consider the external and internal issues, the requirements of relevant interested parties, and the products and services of the organization. The scope shall be available and be maintained as documented information.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Context of the organization",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "4.4",
      "title": "Quality management system and its processes",
      "description": "The organization shall establish, implement, maintain and continually improve a quality management system, including the processes needed and their interactions.",
      "description_long": "The organization shall determine the processes needed for the quality management system and their application throughout the organization, determine the inputs required and the outputs expected from these processes, determine the sequence and interaction of these processes, and determine and apply the criteria and methods needed to ensure the effective operation and control of these processes.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Context of the organization",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "5.1",
      "title": "Leadership and commitment",
      "description": "Top management shall demonstrate leadership and commitment with respect to the quality management system.",
      "description_long": "Top management shall demonstrate leadership and commitment by taking accountability for the effectiveness of the quality management system, ensuring that the quality policy and quality objectives are established and are compatible with the context and strategic direction of the organization, ensuring the integration of the quality management system requirements into the organization's business processes, promoting the use of the process approach and risk-based thinking, and ensuring that the resources needed for the quality management system are available.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Leadership",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "5.1.2",
      "title": "Customer focus",
      "description": "Top management shall demonstrate leadership and commitment with respect to customer focus by ensuring that customer and applicable statutory and regulatory requirements are determined, understood and consistently met.",
      "description_long": "Top management shall ensure that the risks and opportunities that can affect conformity of products and services and the ability to enhance customer satisfaction are determined and addressed, and that the focus on enhancing customer satisfaction is maintained.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Leadership",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "5.2",
      "title": "Policy",
      "description": "Top management shall establish, implement and maintain a quality policy that is appropriate to the purpose and context of the organization and supports its strategic direction.",
      "description_long": "The quality policy shall provide a framework for setting quality objectives, include a commitment to satisfy applicable requirements, and include a commitment to continual improvement of the quality management system. The quality policy shall be available as documented information, be communicated, understood and applied within the organization, and be available to relevant interested parties, as appropriate.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Leadership",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "5.3",
      "title": "Organizational roles, responsibilities and authorities",
      "description": "Top management shall ensure that the responsibilities and authorities for relevant roles are assigned, communicated and understood within the organization.",
      "description_long": "Top management shall assign the responsibility and authority for ensuring that the quality management system conforms to the requirements of this International Standard, ensuring that the processes are delivering their intended outputs, reporting on the performance of the quality management system and on opportunities for improvement, ensuring the promotion of customer focus throughout the organization, and ensuring that the integrity of the quality management system is maintained when changes to the quality management system are planned and implemented.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Leadership",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "6.1",
      "title": "Actions to address risks and opportunities",
      "description": "When planning for the quality management system, the organization shall consider the issues and requirements and determine the risks and opportunities that need to be addressed.",
      "description_long": "The organization shall plan actions to address these risks and opportunities, how to integrate and implement the actions into its quality management system processes, and how to evaluate the effectiveness of these actions. Actions taken to address risks and opportunities shall be proportionate to the potential impact on the conformity of products and services.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Planning",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "risk-management"]
    },
    {
      "code": "6.2",
      "title": "Quality objectives and planning to achieve them",
      "description": "The organization shall establish quality objectives at relevant functions, levels and processes needed for the quality management system.",
      "description_long": "The quality objectives shall be consistent with the quality policy, be measurable, take into account applicable requirements, be relevant to conformity of products and services and to enhancement of customer satisfaction, be monitored, be communicated, and be updated as appropriate. The organization shall retain documented information on the quality objectives.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Planning",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "6.3",
      "title": "Planning of changes",
      "description": "When the organization determines the need for changes to the quality management system, the changes shall be carried out in a planned manner.",
      "description_long": "The organization shall consider the purpose of the changes and their potential consequences, the integrity of the quality management system, the availability of resources, and the allocation or reallocation of responsibilities and authorities.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Planning",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.1",
      "title": "Resources",
      "description": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the quality management system.",
      "description_long": "The organization shall consider the capabilities of, and constraints on, existing internal resources, and what needs to be obtained from external providers. Resources include people, infrastructure, environment for the operation of processes, monitoring and measuring resources, and organizational knowledge.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.1.2",
      "title": "People",
      "description": "The organization shall determine and provide the persons necessary for the effective implementation of its quality management system and for the operation and control of its processes.",
      "description_long": "The organization shall determine and provide the persons necessary for the effective implementation of its quality management system and for the operation and control of its processes.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "hr"]
    },
    {
      "code": "7.1.3",
      "title": "Infrastructure",
      "description": "The organization shall determine, provide and maintain the infrastructure necessary for the operation of its processes and to achieve conformity of products and services.",
      "description_long": "Infrastructure can include buildings and associated utilities, equipment including hardware and software, transportation resources, and information and communication technology.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.1.4",
      "title": "Environment for the operation of processes",
      "description": "The organization shall determine, provide and maintain the environment necessary for the operation of its processes and to achieve conformity of products and services.",
      "description_long": "A suitable environment can be a combination of human and physical factors, such as social (e.g. non-discriminatory, calm, non-confrontational), psychological (e.g. stress-reducing, burnout prevention, emotionally protective), and physical (e.g. temperature, heat, humidity, light, airflow, hygiene, noise).",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.1.5",
      "title": "Monitoring and measuring resources",
      "description": "The organization shall determine and provide the resources needed to ensure valid and reliable results when monitoring or measuring is used to verify the conformity of products and services to requirements.",
      "description_long": "The organization shall ensure that the resources provided are suitable for the specific type of monitoring and measurement activities being undertaken, and are maintained to ensure their continuing fitness for their purpose. The organization shall retain appropriate documented information as evidence of fitness for purpose of the monitoring and measurement resources.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.1.6",
      "title": "Organizational knowledge",
      "description": "The organization shall determine the knowledge necessary for the operation of its processes and to achieve conformity of products and services.",
      "description_long": "This knowledge shall be maintained and be made available to the extent necessary. When addressing changing needs and trends, the organization shall consider its current knowledge and determine how to acquire or access any necessary additional knowledge and required updates.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.2",
      "title": "Competence",
      "description": "The organization shall determine the necessary competence of person(s) doing work under its control that affects the performance and effectiveness of the quality management system.",
      "description_long": "The organization shall ensure that these persons are competent on the basis of appropriate education, training, or experience, where applicable take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken, and retain appropriate documented information as evidence of competence.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "training"]
    },
    {
      "code": "7.3",
      "title": "Awareness",
      "description": "The organization shall ensure that persons doing work under the organization's control are aware of the quality policy, relevant quality objectives, their contribution to the effectiveness of the quality management system, and the implications of not conforming with the quality management system requirements.",
      "description_long": "Persons doing work under the organization's control shall be aware of the quality policy, relevant quality objectives, their contribution to the effectiveness of the quality management system including the benefits of improved performance, and the implications of not conforming with the quality management system requirements.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "training"]
    },
    {
      "code": "7.4",
      "title": "Communication",
      "description": "The organization shall determine the internal and external communications relevant to the quality management system.",
      "description_long": "The organization shall determine the internal and external communications relevant to the quality management system including on what it will communicate, when to communicate, with whom to communicate, how to communicate, and who communicates.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "7.5",
      "title": "Documented information",
      "description": "The organization's quality management system shall include documented information required by this International Standard and documented information determined by the organization as being necessary for the effectiveness of the quality management system.",
      "description_long": "When creating and updating documented information, the organization shall ensure appropriate identification and description, format and media, and review and approval for suitability and adequacy. Documented information required by the quality management system and by this International Standard shall be controlled to ensure it is available and suitable for use, where and when it is needed, and it is adequately protected.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Support",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "8.1",
      "title": "Operational planning and control",
      "description": "The organization shall plan, implement and control the processes needed to meet the requirements for the provision of products and services, and to implement the actions determined in Clause 6.",
      "description_long": "The organization shall plan, implement and control the processes needed to meet the requirements for the provision of products and services by determining the requirements for the products and services, establishing criteria for the processes and for the acceptance of products and services, determining the resources needed to achieve conformity to the product and service requirements, implementing control of the processes in accordance with the criteria, and determining, maintaining and retaining documented information to the extent necessary.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "operations"]
    },
    {
      "code": "8.2",
      "title": "Requirements for products and services",
      "description": "The organization shall implement processes for communication with customers, determination of requirements, and review of requirements related to products and services.",
      "description_long": "Communication with customers shall include providing information relating to products and services, handling enquiries, contracts or orders, obtaining customer feedback relating to products and services, handling or controlling customer property, and establishing specific requirements for contingency actions when relevant.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "8.3",
      "title": "Design and development of products and services",
      "description": "The organization shall establish, implement and maintain a design and development process that is appropriate to ensure the subsequent provision of products and services.",
      "description_long": "In determining the stages and controls for design and development, the organization shall consider the nature, duration and complexity of the design and development activities, the required process stages, the required design and development verification and validation activities, the responsibilities and authorities involved in the design and development process, the internal and external resource needs, the need to control interfaces between persons involved in the design and development process, the need for involvement of customers and users in the design and development process, the requirements for subsequent provision of products and services, the level of control expected for the design and development process by customers and other relevant interested parties, and the documented information needed to demonstrate that design and development requirements have been met.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "development"]
    },
    {
      "code": "8.4",
      "title": "Control of externally provided processes, products and services",
      "description": "The organization shall ensure that externally provided processes, products and services conform to requirements.",
      "description_long": "The organization shall determine the controls to be applied to externally provided processes, products and services when products and services from external providers are intended for incorporation into the organization's own products and services, products and services are provided directly to the customer(s) by external providers on behalf of the organization, and a process, or part of a process, is provided by an external provider as a result of a decision by the organization.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "vendor-management"]
    },
    {
      "code": "8.5",
      "title": "Production and service provision",
      "description": "The organization shall implement production and service provision under controlled conditions.",
      "description_long": "Controlled conditions shall include the availability of documented information that defines the characteristics of the products to be produced, the services to be provided, or the activities to be performed, and the results to be achieved, the availability and use of suitable monitoring and measuring resources, the implementation of monitoring and measurement activities at appropriate stages to verify that criteria for control of processes or outputs, and acceptance criteria for products and services, have been met, the use of suitable infrastructure and environment for the operation of processes, the appointment of competent persons, including any required qualification, the validation, and periodic revalidation, of the ability to achieve planned results of the processes for production and service provision, where the resulting output cannot be verified by subsequent monitoring or measurement, the implementation of actions to prevent human error, and the implementation of release, delivery and post-delivery activities.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "operations"]
    },
    {
      "code": "8.6",
      "title": "Release of products and services",
      "description": "The organization shall implement planned arrangements, at appropriate stages, to verify that the product and service requirements have been met.",
      "description_long": "The release of products and services to the customer shall not proceed until the planned arrangements have been satisfactorily completed, unless otherwise approved by a relevant authority and, as applicable, by the customer. The organization shall retain documented information on the release of products and services. The documented information shall include evidence of conformity with the acceptance criteria and traceability to the person(s) authorizing the release.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "8.7",
      "title": "Control of nonconforming outputs",
      "description": "The organization shall ensure that outputs that do not conform to their requirements are identified and controlled to prevent their unintended use or delivery.",
      "description_long": "The organization shall take appropriate action based on the nature of the nonconformity and its effect on the conformity of products and services. This shall also apply to nonconforming products and services detected after delivery of products, during or after the provision of services. The organization shall deal with nonconforming outputs in one or more of the following ways: correction, segregation, containment, return or suspension of provision of products and services, informing the customer, and obtaining authorization for acceptance under concession.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Operation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "9.1",
      "title": "Monitoring, measurement, analysis and evaluation",
      "description": "The organization shall determine what needs to be monitored and measured, the methods for monitoring, measurement, analysis and evaluation needed to ensure valid results.",
      "description_long": "The organization shall determine what needs to be monitored and measured, the methods for monitoring, measurement, analysis and evaluation needed to ensure valid results, when the monitoring and measuring shall be performed, and when the results from monitoring and measurement shall be analyzed and evaluated. The organization shall evaluate the performance and the effectiveness of the quality management system. The organization shall retain appropriate documented information as evidence of the results.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Performance evaluation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "9.1.2",
      "title": "Customer satisfaction",
      "description": "The organization shall monitor customers' perceptions of the degree to which their needs and expectations have been fulfilled.",
      "description_long": "The organization shall determine the methods for obtaining, monitoring and reviewing this information. Examples of monitoring customer perceptions can include customer surveys, customer feedback on delivered products and services, meetings with customers, market-share analysis, compliments, warranty claims and dealer reports.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Performance evaluation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "9.1.3",
      "title": "Analysis and evaluation",
      "description": "The organization shall analyze and evaluate appropriate data and information arising from monitoring and measurement.",
      "description_long": "The results of analysis shall be used to evaluate conformity of products and services, the degree of customer satisfaction, the performance and effectiveness of the quality management system, if planning has been implemented effectively, the effectiveness of actions taken to address risks and opportunities, the performance of external providers, and the need for improvements to the quality management system.",
      "hierarchy_level": "subcontrol",
      "domain": "quality",
      "category": "Performance evaluation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "9.2",
      "title": "Internal audit",
      "description": "The organization shall conduct internal audits at planned intervals to provide information on whether the quality management system conforms to the organization's own requirements and the requirements of this International Standard, and is effectively implemented and maintained.",
      "description_long": "The organization shall plan, establish, implement and maintain an audit programme(s) including the frequency, methods, responsibilities, planning requirements and reporting, which shall take into consideration the importance of the processes concerned, changes affecting the organization, and the results of previous audits. The organization shall define the audit criteria and scope for each audit, select auditors and conduct audits to ensure objectivity and the impartiality of the audit process, ensure that the results of the audits are reported to relevant management, take appropriate correction and corrective actions without undue delay, and retain documented information as evidence of the implementation of the audit programme and the audit results.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Performance evaluation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "audit"]
    },
    {
      "code": "9.3",
      "title": "Management review",
      "description": "Top management shall review the organization's quality management system, at planned intervals, to ensure its continuing suitability, adequacy, effectiveness and alignment with the strategic direction of the organization.",
      "description_long": "The management review shall be planned and carried out taking into consideration the status of actions from previous management reviews, changes in external and internal issues that are relevant to the quality management system, information on the performance and effectiveness of the quality management system, the adequacy of resources, the effectiveness of actions taken to address risks and opportunities, and opportunities for improvement.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Performance evaluation",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality", "governance"]
    },
    {
      "code": "10.1",
      "title": "General improvement",
      "description": "The organization shall determine and select opportunities for improvement and implement any necessary actions to meet customer requirements and enhance customer satisfaction.",
      "description_long": "These shall include improving products and services to meet requirements as well as to address future needs and expectations, correcting, preventing or reducing undesired effects, and improving the performance and effectiveness of the quality management system.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Improvement",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "10.2",
      "title": "Nonconformity and corrective action",
      "description": "When a nonconformity occurs, including any arising from complaints, the organization shall react to the nonconformity and take action to control and correct it and deal with the consequences.",
      "description_long": "The organization shall evaluate the need for action to eliminate the cause(s) of the nonconformity, in order that it does not recur or occur elsewhere, by reviewing and analyzing the nonconformity, determining the causes of the nonconformity, and determining if similar nonconformities exist, or could potentially occur. The organization shall implement any action needed, review the effectiveness of any corrective action taken, update risks and opportunities determined during planning if necessary, and make changes to the quality management system if necessary.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Improvement",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    },
    {
      "code": "10.3",
      "title": "Continual improvement",
      "description": "The organization shall continually improve the suitability, adequacy and effectiveness of the quality management system.",
      "description_long": "The organization shall consider the results of analysis and evaluation, and the outputs from management review, to determine if there are needs or opportunities that shall be addressed as part of continual improvement.",
      "hierarchy_level": "clause",
      "domain": "quality",
      "category": "Improvement",
      "regulation": "ISO 9001:2015",
      "metadata_tags": ["quality"]
    }
  ]
}
