{
  "family": "kvkk",
  "version": "2016",
  "name": "KVKK (Turkish Personal Data Protection Law) / GDPR Alignment",
  "description": "Personal Data Protection Law No. 6698 (KVKK) aligned with GDPR requirements",
  "requirements": [
    {
      "code": "KVKK-4",
      "title": "General Principles for Processing Personal Data",
      "description": "Personal data shall be processed in accordance with the law and in good faith, accurate and up to date, for specified, explicit and legitimate purposes, relevant, limited and proportionate, and retained for the period required.",
      "description_long": "Personal data shall be processed in accordance with the law and in good faith. Personal data shall be accurate and, where necessary, kept up to date. Personal data shall be processed for specified, explicit and legitimate purposes. Personal data shall be relevant, limited and proportionate to the purposes for which they are processed. Personal data shall be retained for the period stipulated by the relevant legislation or required for the purpose for which they are processed.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "General Principles",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-5",
      "title": "Conditions for Processing Personal Data",
      "description": "Personal data may only be processed with the explicit consent of the data subject or under specific legal conditions.",
      "description_long": "Personal data may be processed without explicit consent if it is expressly provided for by the laws, it is necessary for the protection of life or physical integrity of the person or another person who is physically or legally incapable of giving consent, it is necessary for the processing of personal data of the parties to a contract, it is necessary for the data controller to fulfill its legal obligation, the data has been made public by the data subject, data processing is necessary for the establishment, exercise or protection of a right, or data processing is necessary for the legitimate interests of the data controller.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Processing Conditions",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-6",
      "title": "Conditions for Processing Special Categories of Personal Data",
      "description": "Special categories of personal data (sensitive data) relating to race, ethnic origin, political opinions, philosophical beliefs, religion, sect or other beliefs, appearance and dressing, membership to associations, foundations or trade-unions, health, sexual life, criminal convictions and security measures, and biometric and genetic data may only be processed under specific conditions.",
      "description_long": "Data relating to race, ethnic origin, political opinions, philosophical beliefs, religion, sect or other beliefs, appearance and dressing, membership to associations, foundations or trade-unions, health, sexual life, criminal convictions and security measures, and biometric and genetic data are special categories of personal data. Special categories of personal data may not be processed without the explicit consent of the data subject. Special categories of personal data other than those relating to health and sexual life may be processed without the explicit consent of the data subject only if this is provided for by the laws.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Special Categories",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-7",
      "title": "Erasure, Destruction or Anonymization of Personal Data",
      "description": "Personal data shall be erased, destroyed or anonymized by the data controller ex officio or upon the request of the data subject when the reasons requiring its processing no longer exist.",
      "description_long": "Although personal data has been processed in accordance with the provisions of this Law and other relevant laws, personal data shall be erased, destroyed or anonymized by the data controller ex officio or upon the request of the data subject when the reasons requiring its processing no longer exist. Procedures and principles regarding the erasure, destruction or anonymization of personal data shall be regulated by a regulation.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Data Retention",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "data-management"]
    },
    {
      "code": "KVKK-8",
      "title": "Transfer of Personal Data",
      "description": "Personal data may be transferred to third parties with the explicit consent of the data subject or under specific legal conditions.",
      "description_long": "Personal data may not be transferred without the explicit consent of the data subject. Personal data may be transferred without the explicit consent of the data subject if the conditions set forth in Article 5 paragraph 2 and Article 6 paragraph 3 are met. The data controller and the person to whom the data is transferred are obliged to take the necessary measures for the protection of personal data.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Data Transfer",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-9",
      "title": "Transfer of Personal Data Abroad",
      "description": "Personal data may be transferred abroad with the explicit consent of the data subject or under specific conditions including adequate protection in the destination country.",
      "description_long": "Personal data may be transferred abroad with the explicit consent of the data subject. Personal data may be transferred abroad without the explicit consent of the data subject if the conditions set forth in Article 5 paragraph 2 and Article 6 paragraph 3 are met and there is adequate protection in the foreign country to which the data will be transferred. If there is no adequate protection, data controllers in Turkey and in the relevant foreign country shall undertake adequate protection in writing and the Board shall grant permission.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "International Transfer",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-10",
      "title": "Obligation to Inform",
      "description": "The data controller or the person authorized by the data controller shall inform the data subject about the identity of the data controller, the purpose of processing, to whom and for what purpose the data may be transferred, the method and legal reason for data collection, and the rights of the data subject.",
      "description_long": "During the collection of personal data, the data controller or the person authorized by the data controller shall inform the data subject about the identity of the data controller and of his representative, if any, the purpose of processing personal data, to whom and for what purpose the processed personal data may be transferred, the method and legal reason for collecting personal data, and the rights of the data subject listed in Article 11.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Transparency",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-11",
      "title": "Rights of the Data Subject",
      "description": "Data subjects have the right to learn whether their personal data is processed, request information, learn the purpose of processing, know third parties to whom data is transferred, request correction, request erasure, object to processing, and claim compensation for damages.",
      "description_long": "Everyone has the right to apply to the data controller to learn whether or not personal data relating to him/her is being processed, to request information if his/her personal data has been processed, to learn the purpose of processing personal data and whether they are used in accordance with their purpose, to know the third parties to whom personal data is transferred domestically or abroad, to request the correction of personal data if it is incomplete or inaccurate, to request the erasure or destruction of personal data, to request notification of the operations carried out to third parties to whom personal data has been transferred, to object to the occurrence of a result against the person himself/herself by analyzing the processed data exclusively through automated systems, and to claim compensation for the damage arising from the unlawful processing of personal data.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Data Subject Rights",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-12",
      "title": "Data Security",
      "description": "The data controller shall take all necessary technical and organizational measures to ensure an appropriate level of security for the protection of personal data.",
      "description_long": "The data controller shall take all necessary technical and organizational measures to provide an appropriate level of security in order to prevent unlawful processing of personal data, prevent unlawful access to personal data, and ensure the retention of personal data. If personal data is processed on behalf of the data controller by another natural or legal person, the data controller shall be jointly responsible with these persons for taking the measures mentioned above. The data controller shall carry out the necessary audits within its own institution or have them carried out in order to ensure the implementation of the provisions of this Law.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Security",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "security"]
    },
    {
      "code": "KVKK-13",
      "title": "Application to the Data Controller",
      "description": "Data subjects shall first apply to the data controller regarding their requests. The data controller shall conclude the request free of charge within thirty days at the latest.",
      "description_long": "Data subjects shall first apply to the data controller regarding their requests within the scope of this Law. The data controller shall conclude the requests free of charge within thirty days at the latest depending on the nature of the request. However, if the transaction requires an additional cost, the fee determined by the Board may be charged. The data controller shall accept the request or reject it by explaining the reason and notify the data subject in writing or electronically.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Complaints",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "KVKK-16",
      "title": "Data Controllers Registry",
      "description": "Data controllers shall register with the Data Controllers Registry before starting to process data.",
      "description_long": "Data controllers shall register with the Data Controllers Registry before starting to process data. In the registration application, the identity and address information of the data controller and its representative, if any, the purpose of processing personal data, explanations about the data subject group and groups of data relating to these persons, the recipients or recipient groups to whom personal data may be transferred, personal data envisaged to be transferred abroad, the measures taken regarding data security, and the maximum period required for the purpose for which personal data is processed shall be declared.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Registration",
      "regulation": "KVKK Law No. 6698",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-5",
      "title": "Principles relating to processing of personal data",
      "description": "Personal data shall be processed lawfully, fairly and in a transparent manner, collected for specified, explicit and legitimate purposes, adequate, relevant and limited, accurate and kept up to date, kept for no longer than necessary, and processed with appropriate security.",
      "description_long": "Personal data shall be processed lawfully, fairly and in a transparent manner in relation to the data subject (lawfulness, fairness and transparency). Personal data shall be collected for specified, explicit and legitimate purposes and not further processed in a manner that is incompatible with those purposes (purpose limitation). Personal data shall be adequate, relevant and limited to what is necessary in relation to the purposes for which they are processed (data minimisation). Personal data shall be accurate and, where necessary, kept up to date (accuracy). Personal data shall be kept in a form which permits identification of data subjects for no longer than is necessary (storage limitation). Personal data shall be processed in a manner that ensures appropriate security (integrity and confidentiality).",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Principles",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-6",
      "title": "Lawfulness of processing",
      "description": "Processing shall be lawful only if and to the extent that at least one of the following applies: consent, contract, legal obligation, vital interests, public interest, or legitimate interests.",
      "description_long": "Processing shall be lawful only if and to the extent that at least one of the following applies: the data subject has given consent to the processing of his or her personal data for one or more specific purposes; processing is necessary for the performance of a contract to which the data subject is party; processing is necessary for compliance with a legal obligation to which the controller is subject; processing is necessary in order to protect the vital interests of the data subject or of another natural person; processing is necessary for the performance of a task carried out in the public interest; processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Lawfulness",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-7",
      "title": "Conditions for consent",
      "description": "Where processing is based on consent, the controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data.",
      "description_long": "Where processing is based on consent, the controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data. If the data subject's consent is given in the context of a written declaration which also concerns other matters, the request for consent shall be presented in a manner which is clearly distinguishable from the other matters, in an intelligible and easily accessible form, using clear and plain language. The data subject shall have the right to withdraw his or her consent at any time.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Consent",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-9",
      "title": "Processing of special categories of personal data",
      "description": "Processing of personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, genetic data, biometric data, health data, or data concerning sex life or sexual orientation shall be prohibited except under specific conditions.",
      "description_long": "Processing of personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or data concerning a natural person's sex life or sexual orientation shall be prohibited. This prohibition shall not apply if the data subject has given explicit consent, processing is necessary for employment and social security law, processing is necessary to protect vital interests, processing is carried out by a foundation or association, the data has been made public by the data subject, processing is necessary for legal claims, processing is necessary for substantial public interest, processing is necessary for health purposes, or processing is necessary for public health.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Special Categories",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-12",
      "title": "Transparent information, communication and modalities for the exercise of the rights of the data subject",
      "description": "The controller shall take appropriate measures to provide any information and any communication relating to processing to the data subject in a concise, transparent, intelligible and easily accessible form, using clear and plain language.",
      "description_long": "The controller shall take appropriate measures to provide any information referred to in Articles 13 and 14 and any communication under Articles 15 to 22 and 34 relating to processing to the data subject in a concise, transparent, intelligible and easily accessible form, using clear and plain language, in particular for any information addressed specifically to a child. The information shall be provided in writing, or by other means, including, where appropriate, by electronic means. When requested by the data subject, the information may be provided orally, provided that the identity of the data subject is proven by other means.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Transparency",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-13",
      "title": "Information to be provided where personal data are collected from the data subject",
      "description": "Where personal data relating to a data subject are collected from the data subject, the controller shall provide the data subject with specific information at the time when personal data are obtained.",
      "description_long": "Where personal data relating to a data subject are collected from the data subject, the controller shall, at the time when personal data are obtained, provide the data subject with the identity and contact details of the controller, the contact details of the data protection officer, the purposes of the processing and the legal basis, the legitimate interests pursued by the controller, the recipients of the personal data, and information about transfers to third countries. The controller shall also provide information about the period for which the data will be stored, the existence of data subject rights, the right to withdraw consent, the right to lodge a complaint, whether the provision of data is a statutory or contractual requirement, and the existence of automated decision-making.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Information",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-15",
      "title": "Right of access by the data subject",
      "description": "The data subject shall have the right to obtain from the controller confirmation as to whether or not personal data concerning him or her are being processed, and, where that is the case, access to the personal data.",
      "description_long": "The data subject shall have the right to obtain from the controller confirmation as to whether or not personal data concerning him or her are being processed, and, where that is the case, access to the personal data and the following information: the purposes of the processing, the categories of personal data concerned, the recipients to whom the personal data have been or will be disclosed, the envisaged period for which the personal data will be stored, the existence of the right to request rectification or erasure, the right to lodge a complaint, information about the source of the data, and the existence of automated decision-making.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Access Rights",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-16",
      "title": "Right to rectification",
      "description": "The data subject shall have the right to obtain from the controller without undue delay the rectification of inaccurate personal data concerning him or her.",
      "description_long": "The data subject shall have the right to obtain from the controller without undue delay the rectification of inaccurate personal data concerning him or her. Taking into account the purposes of the processing, the data subject shall have the right to have incomplete personal data completed, including by means of providing a supplementary statement.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Rectification",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-17",
      "title": "Right to erasure ('right to be forgotten')",
      "description": "The data subject shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay under specific conditions.",
      "description_long": "The data subject shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay and the controller shall have the obligation to erase personal data without undue delay where the personal data are no longer necessary, the data subject withdraws consent, the data subject objects to the processing, the personal data have been unlawfully processed, the personal data have to be erased for compliance with a legal obligation, or the personal data have been collected in relation to the offer of information society services to a child.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Erasure",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-18",
      "title": "Right to restriction of processing",
      "description": "The data subject shall have the right to obtain from the controller restriction of processing under specific conditions.",
      "description_long": "The data subject shall have the right to obtain from the controller restriction of processing where the accuracy of the personal data is contested by the data subject, the processing is unlawful and the data subject opposes the erasure of the personal data, the controller no longer needs the personal data for the purposes of the processing but they are required by the data subject for the establishment, exercise or defence of legal claims, or the data subject has objected to processing pending the verification whether the legitimate grounds of the controller override those of the data subject.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Restriction",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-20",
      "title": "Right to data portability",
      "description": "The data subject shall have the right to receive the personal data concerning him or her in a structured, commonly used and machine-readable format and have the right to transmit those data to another controller.",
      "description_long": "The data subject shall have the right to receive the personal data concerning him or her, which he or she has provided to a controller, in a structured, commonly used and machine-readable format and have the right to transmit those data to another controller without hindrance from the controller to which the personal data have been provided, where the processing is based on consent or on a contract and the processing is carried out by automated means.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Portability",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-21",
      "title": "Right to object",
      "description": "The data subject shall have the right to object, on grounds relating to his or her particular situation, at any time to processing of personal data concerning him or her.",
      "description_long": "The data subject shall have the right to object, on grounds relating to his or her particular situation, at any time to processing of personal data concerning him or her which is based on public interest or legitimate interests, including profiling based on those provisions. The controller shall no longer process the personal data unless the controller demonstrates compelling legitimate grounds for the processing which override the interests, rights and freedoms of the data subject or for the establishment, exercise or defence of legal claims.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Objection",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-22",
      "title": "Automated individual decision-making, including profiling",
      "description": "The data subject shall have the right not to be subject to a decision based solely on automated processing, including profiling, which produces legal effects concerning him or her or similarly significantly affects him or her.",
      "description_long": "The data subject shall have the right not to be subject to a decision based solely on automated processing, including profiling, which produces legal effects concerning him or her or similarly significantly affects him or her. This shall not apply if the decision is necessary for entering into, or performance of, a contract, is authorised by Union or Member State law, or is based on the data subject's explicit consent.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Automated Decisions",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-25",
      "title": "Data protection by design and by default",
      "description": "The controller shall implement appropriate technical and organisational measures for ensuring that, by default, only personal data which are necessary for each specific purpose of the processing are processed.",
      "description_long": "Taking into account the state of the art, the cost of implementation and the nature, scope, context and purposes of processing as well as the risks of varying likelihood and severity for rights and freedoms of natural persons posed by the processing, the controller shall, both at the time of the determination of the means for processing and at the time of the processing itself, implement appropriate technical and organisational measures, such as pseudonymisation, which are designed to implement data-protection principles, such as data minimisation, in an effective manner and to integrate the necessary safeguards into the processing.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Privacy by Design",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "security"]
    },
    {
      "code": "GDPR-28",
      "title": "Processor",
      "description": "Where processing is to be carried out on behalf of a controller, the controller shall use only processors providing sufficient guarantees to implement appropriate technical and organisational measures.",
      "description_long": "Where processing is to be carried out on behalf of a controller, the controller shall use only processors providing sufficient guarantees to implement appropriate technical and organisational measures in such a manner that processing will meet the requirements of this Regulation and ensure the protection of the rights of the data subject. Processing by a processor shall be governed by a contract or other legal act that is binding on the processor with regard to the controller.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Processors",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "vendor-management"]
    },
    {
      "code": "GDPR-30",
      "title": "Records of processing activities",
      "description": "Each controller and processor shall maintain a record of processing activities under its responsibility.",
      "description_long": "Each controller and, where applicable, the controller's representative, shall maintain a record of processing activities under its responsibility. That record shall contain the name and contact details of the controller, the purposes of the processing, a description of the categories of data subjects and of the categories of personal data, the categories of recipients, transfers to third countries, the envisaged time limits for erasure, and a general description of the technical and organisational security measures.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Records",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    },
    {
      "code": "GDPR-32",
      "title": "Security of processing",
      "description": "The controller and the processor shall implement appropriate technical and organisational measures to ensure a level of security appropriate to the risk.",
      "description_long": "Taking into account the state of the art, the costs of implementation and the nature, scope, context and purposes of processing as well as the risk of varying likelihood and severity for the rights and freedoms of natural persons, the controller and the processor shall implement appropriate technical and organisational measures to ensure a level of security appropriate to the risk, including as appropriate the pseudonymisation and encryption of personal data, the ability to ensure the ongoing confidentiality, integrity, availability and resilience of processing systems and services, the ability to restore the availability and access to personal data in a timely manner in the event of a physical or technical incident, and a process for regularly testing, assessing and evaluating the effectiveness of technical and organisational measures.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Security",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "security"]
    },
    {
      "code": "GDPR-33",
      "title": "Notification of a personal data breach to the supervisory authority",
      "description": "In the case of a personal data breach, the controller shall without undue delay and, where feasible, not later than 72 hours after having become aware of it, notify the personal data breach to the supervisory authority.",
      "description_long": "In the case of a personal data breach, the controller shall without undue delay and, where feasible, not later than 72 hours after having become aware of it, notify the personal data breach to the supervisory authority competent in accordance with Article 55, unless the personal data breach is unlikely to result in a risk to the rights and freedoms of natural persons. Where the notification to the supervisory authority is not made within 72 hours, it shall be accompanied by reasons for the delay.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Breach Notification",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "incident-management"]
    },
    {
      "code": "GDPR-34",
      "title": "Communication of a personal data breach to the data subject",
      "description": "When the personal data breach is likely to result in a high risk to the rights and freedoms of natural persons, the controller shall communicate the personal data breach to the data subject without undue delay.",
      "description_long": "When the personal data breach is likely to result in a high risk to the rights and freedoms of natural persons, the controller shall communicate the personal data breach to the data subject without undue delay. The communication to the data subject shall describe in clear and plain language the nature of the personal data breach and contain at least the information and measures referred to in Article 33.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Breach Communication",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "incident-management"]
    },
    {
      "code": "GDPR-35",
      "title": "Data protection impact assessment",
      "description": "Where a type of processing is likely to result in a high risk to the rights and freedoms of natural persons, the controller shall carry out an assessment of the impact of the envisaged processing operations on the protection of personal data.",
      "description_long": "Where a type of processing in particular using new technologies, and taking into account the nature, scope, context and purposes of the processing, is likely to result in a high risk to the rights and freedoms of natural persons, the controller shall, prior to the processing, carry out an assessment of the impact of the envisaged processing operations on the protection of personal data. A single assessment may address a set of similar processing operations that present similar high risks.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "Impact Assessment",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "risk-management"]
    },
    {
      "code": "GDPR-37",
      "title": "Designation of the data protection officer",
      "description": "The controller and the processor shall designate a data protection officer in any case where the processing is carried out by a public authority or body, the core activities consist of processing operations which require regular and systematic monitoring, or the core activities consist of processing on a large scale of special categories of data.",
      "description_long": "The controller and the processor shall designate a data protection officer in any case where the processing is carried out by a public authority or body, except for courts acting in their judicial capacity, the core activities of the controller or the processor consist of processing operations which, by virtue of their nature, their scope and/or their purposes, require regular and systematic monitoring of data subjects on a large scale, or the core activities of the controller or the processor consist of processing on a large scale of special categories of data pursuant to Article 9 or personal data relating to criminal convictions and offences referred to in Article 10.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "DPO",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "governance"]
    },
    {
      "code": "GDPR-44",
      "title": "General principle for transfers",
      "description": "Any transfer of personal data which are undergoing processing or are intended for processing after transfer to a third country or to an international organisation shall take place only if the conditions laid down in this Chapter are complied with.",
      "description_long": "Any transfer of personal data which are undergoing processing or are intended for processing after transfer to a third country or to an international organisation shall take place only if, subject to the other provisions of this Regulation, the conditions laid down in this Chapter are complied with by the controller and processor, including for onward transfers of personal data from the third country or an international organisation to another third country or to another international organisation.",
      "hierarchy_level": "clause",
      "domain": "privacy",
      "category": "International Transfers",
      "regulation": "GDPR",
      "metadata_tags": ["privacy", "compliance"]
    }
  ]
}
